mattehicks/SCDE/components/ESP32_TouchGUI1_Module/include/ESP32_TouchGUI1_Module.h
// Init for 7735R, part 2 (red tab only)
// -------------------------------------
static const uint8_t Rcmd2red[] = {
  2,						//  2 commands in list:
  TFT_CASET  , 4      ,	    //  1: Column addr set, 4 args, no delay:
  0x00, 0x00,				//     XSTART = 0
  0x00, 0x7F,				//     XEND = 127
  TFT_PASET  , 4      ,	    //  2: Row addr set, 4 args, no delay:
  0x00, 0x00,				//     XSTART = 0
  0x00, 0x9F				//     XEND = 159
};

// Init for 7735R, part 3 (red or green tab)
// -----------------------------------------
static const uint8_t Rcmd3[] = {
  4,						//  4 commands in list:
  ST7735_GMCTRP1, 16      ,	//  1: Magical unicorn dust, 16 args, no delay:
  0x02, 0x1c, 0x07, 0x12,
  0x37, 0x32, 0x29, 0x2d,
  0x29, 0x25, 0x2B, 0x39,
  0x00, 0x01, 0x03, 0x10,
  ST7735_GMCTRN1, 16      ,	//  2: Sparkles and rainbows, 16 args, no delay:
  0x03, 0x1d, 0x07, 0x06,
  0x2E, 0x2C, 0x29, 0x2D,
  0x2E, 0x2E, 0x37, 0x3F,
  0x00, 0x00, 0x02, 0x10,
  ST7735_NORON  ,    TFT_CMD_DELAY,	//  3: Normal display on, no args, w/delay
  10,						//     10 ms delay
  TFT_DISPON ,    TFT_CMD_DELAY,	//  4: Main screen turn on, no args w/delay
  100						//     100 ms delay
};



// ==== Public functions =========================================================



// == Low level functions; usually not used directly ==

//
esp_err_t wait_trans_finish(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint8_t free_line);

//
void ESP32_SPI_transfer_only_cmd(ESP32_SPI_Module_spi_device_handle_t spi_device_handle, int8_t cmd);

//
void ESP32_SPI_transfer_cmd_and_data(ESP32_SPI_Module_spi_device_handle_t spi_device_handle, int8_t cmd, uint8_t *data, uint32_t len);

//
void drawPixel(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y, color_t color, uint8_t sel);

//
void send_data(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x1, int y1, int x2, int y2, uint32_t len, color_t *buf);

//
void TFT_pushColorRep(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x1, int y1, int x2, int y2, color_t data, uint32_t len);

//
int read_data(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int x1, int y1, int x2, int y2, int len, uint8_t *buf, uint8_t set_sp);

//
color_t readPixel(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, int16_t x, int16_t y);

//
int touch_get_data(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint8_t type);


// Deactivate display's CS line
//========================
esp_err_t disp_deselect(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);

// Activate display's CS line and configure SPI interface if necessary
//======================
esp_err_t disp_select(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);


// Find maximum spi clock for successful read from display RAM
// ** Must be used AFTER the display is initialized **
//======================
uint32_t find_rd_speed(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);


// Change the screen rotation.
// Input: m new rotation value (0 to 3)
//=================================
void _tft_setRotation(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint8_t rot);

// Initialize all pins used by display driver
// ** MUST be executed before SPI interface initialization
//=================
void TFT_PinsInit(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);

// Perform display initialization sequence
// Sets orientation to landscape; clears the screen
// * All pins must be configured
// * SPI interface must already be setup
// * 'tft_disp_type', 'COLOR_BITS', '_width', '_height' variables must be set
//======================
void TFT_display_init(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);

//===================
void stmpe610_Init(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);

//============================================================
int stmpe610_get_touch(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint16_t *x, uint16_t *y, uint16_t *z);

//========================
uint32_t stmpe610_getID(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition);

// ===============================================================================


//
static void WriteCommandList(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, ESP32_SPI_Module_spi_device_handle_t spi, const uint8_t *addr);


















/*
 *  Functions provided to SCDE by Module - for type operation (A-Z)
 */
strTextMultiple_t* ESP32_TouchGUI1_Attribute(Common_Definition_t* Common_Definition, const uint8_t *attrCmdText, const size_t attrCmdTextLen, const uint8_t *attrNameText, const size_t attrNameTextLen, uint8_t **attrValTextPtr, size_t *attrValTextLenPtr);

strTextMultiple_t* ESP32_TouchGUI1_Define(Common_Definition_t *Common_Definition);

//strTextMultiple_t* ESP32_TouchGUI1_DirectWrite(Common_Definition_t *Common_Definition_Stage1, Common_Definition_t *Common_Definition_Stage2, Common_StageXCHG_t *Common_StageXCHG);

int ESP32_TouchGUI1_IdleCb(Common_Definition_t *Common_Definition);

int ESP32_TouchGUI1_Initialize(SCDERoot_t* SCDERoot);

strTextMultiple_t* ESP32_TouchGUI1_Set(Common_Definition_t* Common_Definition, uint8_t *setArgs, size_t setArgsLen);

strTextMultiple_t* ESP32_TouchGUI1_Shutdown(Common_Definition_t* Common_Definition);

strTextMultiple_t* ESP32_TouchGUI1_Undefine(Common_Definition_t* Common_Definition);

xMultipleStringSLTQE_t* ESP32_TouchGUI1_Write(Common_Definition_t *Common_Definition, xString_t data);

// -------------------------------------------------------------------------------------------------





/*
 *  helpers provided to module for type operation
 */
strTextMultiple_t* ESP32_TouchGUI1_ProcessKVInputArgs(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, parsedKVInputArgs_t *parsedKVInput, uint8_t *argsText, size_t argsTextLen);

bool ESP32_TouchGUI1_SetAffectedReadings(ESP32_TouchGUI1_Definition_t* ESP32_TouchGUI1_Definition, uint64_t affectedReadings);



#endif /*ESP32_TouchGUI1_MODULE_H*/


